7767517
196 231
Input                    in0                      0 1 in0
Convolution              convrelu_0               1 1 in0 1 0=24 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=648 9=1
Pooling                  maxpool2d_66             1 1 1 2 0=0 1=3 11=3 12=2 13=1 2=2 3=1 5=1
Split                    splitncnn_0              1 2 2 3 4
ConvolutionDepthWise     convdw_141               1 1 4 5 0=24 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=216 7=24
Convolution              convrelu_1               1 1 3 6 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576 9=1
ConvolutionDepthWise     convdw_142               1 1 6 7 0=24 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=216 7=24
Convolution              convrelu_3               1 1 5 8 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576 9=1
Convolution              convrelu_2               1 1 7 9 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576 9=1
Concat                   cat_0                    2 1 8 9 10 0=0
ShuffleChannel           shufflechannel_1         1 1 10 11 0=2 1=1
Slice                    slice_0                  1 2 11 12 13 -23300=2,-233,-233 1=0
Convolution              convrelu_4               1 1 13 14 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576 9=1
ConvolutionDepthWise     convdw_143               1 1 14 15 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=216 7=24
Convolution              convrelu_5               1 1 15 16 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576 9=1
Concat                   cat_1                    2 1 12 16 17 0=0
ShuffleChannel           shufflechannel_3         1 1 17 18 0=2 1=1
Slice                    slice_2                  1 2 18 19 20 -23300=2,-233,-233 1=0
Convolution              convrelu_6               1 1 20 21 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576 9=1
ConvolutionDepthWise     convdw_144               1 1 21 22 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=216 7=24
Convolution              convrelu_7               1 1 22 23 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576 9=1
Concat                   cat_2                    2 1 19 23 24 0=0
ShuffleChannel           shufflechannel_5         1 1 24 25 0=2 1=1
Slice                    slice_4                  1 2 25 26 27 -23300=2,-233,-233 1=0
Convolution              convrelu_8               1 1 27 28 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576 9=1
ConvolutionDepthWise     convdw_145               1 1 28 29 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=216 7=24
Convolution              convrelu_9               1 1 29 30 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576 9=1
Concat                   cat_3                    2 1 26 30 31 0=0
Split                    splitncnn_1              1 3 31 32 33 34
ConvolutionDepthWise     convdw_146               1 1 34 35 0=48 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432 7=48
Convolution              convrelu_10              1 1 33 36 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
ConvolutionDepthWise     convdw_147               1 1 36 37 0=48 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432 7=48
Convolution              convrelu_12              1 1 35 38 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
Convolution              convrelu_11              1 1 37 39 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
Concat                   cat_4                    2 1 38 39 40 0=0
ShuffleChannel           shufflechannel_7         1 1 40 41 0=2 1=1
Slice                    slice_6                  1 2 41 42 43 -23300=2,-233,-233 1=0
Convolution              convrelu_13              1 1 43 44 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
ConvolutionDepthWise     convdw_148               1 1 44 45 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48
Convolution              convrelu_14              1 1 45 46 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
Concat                   cat_5                    2 1 42 46 47 0=0
ShuffleChannel           shufflechannel_9         1 1 47 48 0=2 1=1
Slice                    slice_8                  1 2 48 49 50 -23300=2,-233,-233 1=0
Convolution              convrelu_15              1 1 50 51 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
ConvolutionDepthWise     convdw_149               1 1 51 52 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48
Convolution              convrelu_16              1 1 52 53 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
Concat                   cat_6                    2 1 49 53 54 0=0
ShuffleChannel           shufflechannel_11        1 1 54 55 0=2 1=1
Slice                    slice_10                 1 2 55 56 57 -23300=2,-233,-233 1=0
Convolution              convrelu_17              1 1 57 58 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
ConvolutionDepthWise     convdw_150               1 1 58 59 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48
Convolution              convrelu_18              1 1 59 60 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
Concat                   cat_7                    2 1 56 60 61 0=0
ShuffleChannel           shufflechannel_13        1 1 61 62 0=2 1=1
Slice                    slice_12                 1 2 62 63 64 -23300=2,-233,-233 1=0
Convolution              convrelu_19              1 1 64 65 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
ConvolutionDepthWise     convdw_151               1 1 65 66 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48
Convolution              convrelu_20              1 1 66 67 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
Concat                   cat_8                    2 1 63 67 68 0=0
ShuffleChannel           shufflechannel_15        1 1 68 69 0=2 1=1
Slice                    slice_14                 1 2 69 70 71 -23300=2,-233,-233 1=0
Convolution              convrelu_21              1 1 71 72 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
ConvolutionDepthWise     convdw_152               1 1 72 73 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48
Convolution              convrelu_22              1 1 73 74 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
Concat                   cat_9                    2 1 70 74 75 0=0
ShuffleChannel           shufflechannel_17        1 1 75 76 0=2 1=1
Slice                    slice_16                 1 2 76 77 78 -23300=2,-233,-233 1=0
Convolution              convrelu_23              1 1 78 79 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
ConvolutionDepthWise     convdw_153               1 1 79 80 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48
Convolution              convrelu_24              1 1 80 81 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
Concat                   cat_10                   2 1 77 81 82 0=0
ShuffleChannel           shufflechannel_19        1 1 82 83 0=2 1=1
Slice                    slice_18                 1 2 83 84 85 -23300=2,-233,-233 1=0
Convolution              convrelu_25              1 1 85 86 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
ConvolutionDepthWise     convdw_154               1 1 86 87 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48
Convolution              convrelu_26              1 1 87 88 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
Concat                   cat_11                   2 1 84 88 89 0=0
Split                    splitncnn_2              1 3 89 90 91 92
ConvolutionDepthWise     convdw_155               1 1 92 93 0=96 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=864 7=96
Convolution              convrelu_27              1 1 91 94 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=1
ConvolutionDepthWise     convdw_156               1 1 94 95 0=96 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=864 7=96
Convolution              convrelu_29              1 1 93 96 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=1
Convolution              convrelu_28              1 1 95 97 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=1
Concat                   cat_12                   2 1 96 97 98 0=0
ShuffleChannel           shufflechannel_21        1 1 98 99 0=2 1=1
Slice                    slice_20                 1 2 99 100 101 -23300=2,-233,-233 1=0
Convolution              convrelu_30              1 1 101 102 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=1
ConvolutionDepthWise     convdw_157               1 1 102 103 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96
Convolution              convrelu_31              1 1 103 104 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=1
Concat                   cat_13                   2 1 100 104 105 0=0
ShuffleChannel           shufflechannel_23        1 1 105 106 0=2 1=1
Slice                    slice_22                 1 2 106 107 108 -23300=2,-233,-233 1=0
Convolution              convrelu_32              1 1 108 109 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=1
ConvolutionDepthWise     convdw_158               1 1 109 110 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96
Convolution              convrelu_33              1 1 110 111 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=1
Concat                   cat_14                   2 1 107 111 112 0=0
ShuffleChannel           shufflechannel_25        1 1 112 113 0=2 1=1
Slice                    slice_24                 1 2 113 114 115 -23300=2,-233,-233 1=0
Convolution              convrelu_34              1 1 115 116 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=1
ConvolutionDepthWise     convdw_159               1 1 116 117 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96
Convolution              convrelu_35              1 1 117 118 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=1
Concat                   cat_15                   2 1 114 118 119 0=0
Convolution              convrelu_36              1 1 119 120 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432 9=1
Split                    splitncnn_3              1 2 120 121 122
Interp                   upsample_127             1 1 122 123 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_16                   2 1 123 90 124 0=0
Split                    splitncnn_4              1 2 124 125 126
Convolution              convrelu_40              1 1 126 127 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=1
Convolution              convrelu_37              1 1 125 128 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=1
Convolution              convrelu_38              1 1 128 129 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
Convolution              convrelu_39              1 1 129 130 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=1
Concat                   cat_17                   2 1 130 127 131 0=0
Convolution              convrelu_41              1 1 131 132 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=1
Convolution              convrelu_42              1 1 132 133 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608 9=1
Split                    splitncnn_5              1 2 133 134 135
Interp                   upsample_128             1 1 135 136 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_18                   2 1 136 32 137 0=0
Split                    splitncnn_6              1 2 137 138 139
Convolution              convrelu_46              1 1 139 140 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
Convolution              convrelu_43              1 1 138 141 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
Convolution              convrelu_44              1 1 141 142 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576 9=1
Convolution              convrelu_45              1 1 142 143 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 9=1
Concat                   cat_19                   2 1 143 140 144 0=0
Convolution              convrelu_47              1 1 144 145 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
Split                    splitncnn_7              1 2 145 146 147
Convolution              convrelu_48              1 1 147 148 0=48 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=20736 9=1
Concat                   cat_20                   2 1 148 134 149 0=0
Split                    splitncnn_8              1 2 149 150 151
Convolution              convrelu_52              1 1 151 152 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608 9=1
Convolution              convrelu_49              1 1 150 153 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608 9=1
Convolution              convrelu_50              1 1 153 154 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
Convolution              convrelu_51              1 1 154 155 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=1
Concat                   cat_21                   2 1 155 152 156 0=0
Convolution              convrelu_53              1 1 156 157 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=1
Split                    splitncnn_9              1 2 157 158 159
Convolution              convrelu_54              1 1 159 160 0=96 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=82944 9=1
Concat                   cat_22                   2 1 160 121 161 0=0
Split                    splitncnn_10             1 2 161 162 163
Convolution              convrelu_58              1 1 163 164 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432 9=1
Convolution              convrelu_55              1 1 162 165 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432 9=1
Convolution              convrelu_56              1 1 165 166 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=1
Convolution              convrelu_57              1 1 166 167 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944 9=1
Concat                   cat_23                   2 1 167 164 168 0=0
Convolution              convrelu_59              1 1 168 169 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864 9=1
Convolution              convsigmoid_60           1 1 146 170 0=255 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12240 9=4
Reshape                  view_132                 1 1 170 171 0=1600 1=85 2=3
Permute                  permute_138              1 1 171 172 0=1
Slice                    split_0                  1 3 172 173 174 175 -23300=3,2,2,81 1=2
MemoryData               pnnx_fold_grid.1         0 1 176 0=2 1=1600 2=1
BinaryOp                 mul_0                    1 1 173 177 0=2 1=1 2=2.000000e+00
BinaryOp                 sub_1                    1 1 177 178 0=1 1=1 2=5.000000e-01
BinaryOp                 add_2                    2 1 178 176 179 0=0
BinaryOp                 mul_3                    1 1 179 180 0=2 1=1 2=8.000000e+00
BinaryOp                 mul_4                    1 1 174 181 0=2 1=1 2=2.000000e+00
Split                    splitncnn_11             1 2 181 182 183
MemoryData               pnnx_fold_grid_.1        0 1 184 0=2 1=1600 2=3
BinaryOp                 mul_5                    2 1 182 183 185 0=2
BinaryOp                 mul_6                    2 1 185 184 186 0=2
BinaryOp                 mul_7                    1 1 175 187 0=2 1=1 2=1.000000e+02
Convolution              convsigmoid_61           1 1 158 188 0=255 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24480 9=4
Reshape                  view_133                 1 1 188 189 0=400 1=85 2=3
Permute                  permute_139              1 1 189 190 0=1
Slice                    split_1                  1 3 190 191 192 193 -23300=3,2,2,81 1=2
MemoryData               pnnx_fold_grid0.1        0 1 194 0=2 1=400 2=1
BinaryOp                 mul_8                    1 1 191 195 0=2 1=1 2=2.000000e+00
BinaryOp                 sub_9                    1 1 195 196 0=1 1=1 2=5.000000e-01
BinaryOp                 add_10                   2 1 196 194 197 0=0
BinaryOp                 mul_11                   1 1 197 198 0=2 1=1 2=1.600000e+01
BinaryOp                 mul_12                   1 1 192 199 0=2 1=1 2=2.000000e+00
Split                    splitncnn_12             1 2 199 200 201
MemoryData               pnnx_fold_grid_0.1       0 1 202 0=2 1=400 2=3
BinaryOp                 mul_13                   2 1 200 201 203 0=2
BinaryOp                 mul_14                   2 1 203 202 204 0=2
BinaryOp                 mul_15                   1 1 193 205 0=2 1=1 2=1.000000e+02
Convolution              convsigmoid_62           1 1 169 206 0=255 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=48960 9=4
Reshape                  view_134                 1 1 206 207 0=100 1=85 2=3
Permute                  permute_140              1 1 207 208 0=1
Slice                    split_2                  1 3 208 209 210 211 -23300=3,2,2,81 1=2
MemoryData               pnnx_fold_grid1.1        0 1 212 0=2 1=100 2=1
BinaryOp                 mul_16                   1 1 209 213 0=2 1=1 2=2.000000e+00
BinaryOp                 sub_17                   1 1 213 214 0=1 1=1 2=5.000000e-01
BinaryOp                 add_18                   2 1 214 212 215 0=0
BinaryOp                 mul_19                   1 1 215 216 0=2 1=1 2=3.200000e+01
BinaryOp                 mul_20                   1 1 210 217 0=2 1=1 2=2.000000e+00
Split                    splitncnn_13             1 2 217 218 219
MemoryData               pnnx_fold_grid_1.1       0 1 220 0=2 1=100 2=3
BinaryOp                 mul_21                   2 1 218 219 221 0=2
BinaryOp                 mul_22                   2 1 221 220 222 0=2
BinaryOp                 mul_23                   1 1 211 223 0=2 1=1 2=1.000000e+02
Concat                   cat_24                   3 1 216 222 223 224 0=2
Concat                   cat_25                   3 1 198 204 205 225 0=2
Concat                   cat_26                   3 1 180 186 187 226 0=2
Reshape                  view_137                 1 1 226 227 0=85 1=4800
Reshape                  view_136                 1 1 225 228 0=85 1=1200
Reshape                  view_135                 1 1 224 229 0=85 1=300
Concat                   cat_27                   3 1 227 228 229 out0 0=0
