7767517
159 192
Input                    in0                      0 1 in0
Convolution              convrelu_0               1 1 in0 1 0=16 1=6 11=6 12=1 13=2 14=2 2=1 3=2 4=2 5=1 6=1728 9=1
Convolution              convrelu_1               1 1 1 2 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=4608 9=1
Split                    splitncnn_0              1 2 2 3 4
Convolution              convrelu_2               1 1 3 5 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512 9=1
Split                    splitncnn_1              1 2 5 6 7
Convolution              convrelu_3               1 1 7 8 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256 9=1
Convolution              convrelu_4               1 1 8 9 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=1
BinaryOp                 add_0                    2 1 9 6 10 0=0
Convolution              convrelu_5               1 1 4 11 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512 9=1
Concat                   cat_0                    2 1 10 11 12 0=0
Convolution              convrelu_6               1 1 12 13 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 9=1
Convolution              convrelu_7               1 1 13 14 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=18432 9=1
Split                    splitncnn_2              1 2 14 15 16
Convolution              convrelu_8               1 1 15 17 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=1
Split                    splitncnn_3              1 2 17 18 19
Convolution              convrelu_9               1 1 19 20 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 9=1
Convolution              convrelu_10              1 1 20 21 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
BinaryOp                 add_1                    2 1 21 18 22 0=0
Split                    splitncnn_4              1 2 22 23 24
Convolution              convrelu_11              1 1 24 25 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 9=1
Convolution              convrelu_12              1 1 25 26 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
BinaryOp                 add_2                    2 1 26 23 27 0=0
Convolution              convrelu_13              1 1 16 28 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=1
Concat                   cat_1                    2 1 27 28 29 0=0
Convolution              convrelu_14              1 1 29 30 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
Split                    splitncnn_5              1 2 30 31 32
Convolution              convrelu_15              1 1 32 33 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=73728 9=1
Split                    splitncnn_6              1 2 33 34 35
Convolution              convrelu_16              1 1 34 36 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
Split                    splitncnn_7              1 2 36 37 38
Convolution              convrelu_17              1 1 38 39 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
Convolution              convrelu_18              1 1 39 40 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
BinaryOp                 add_3                    2 1 40 37 41 0=0
Split                    splitncnn_8              1 2 41 42 43
Convolution              convrelu_19              1 1 43 44 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
Convolution              convrelu_20              1 1 44 45 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
BinaryOp                 add_4                    2 1 45 42 46 0=0
Split                    splitncnn_9              1 2 46 47 48
Convolution              convrelu_21              1 1 48 49 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
Convolution              convrelu_22              1 1 49 50 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
BinaryOp                 add_5                    2 1 50 47 51 0=0
Convolution              convrelu_23              1 1 35 52 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
Concat                   cat_2                    2 1 51 52 53 0=0
Convolution              convrelu_24              1 1 53 54 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
Split                    splitncnn_10             1 2 54 55 56
Convolution              convrelu_25              1 1 56 57 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=294912 9=1
Split                    splitncnn_11             1 2 57 58 59
Convolution              convrelu_26              1 1 58 60 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
Split                    splitncnn_12             1 2 60 61 62
Convolution              convrelu_27              1 1 62 63 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
Convolution              convrelu_28              1 1 63 64 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
BinaryOp                 add_6                    2 1 64 61 65 0=0
Convolution              convrelu_29              1 1 59 66 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
Concat                   cat_3                    2 1 65 66 67 0=0
Convolution              convrelu_30              1 1 67 68 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
Convolution              convrelu_31              1 1 68 69 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
Split                    splitncnn_13             1 2 69 70 71
Pooling                  maxpool2d_63             1 1 71 72 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_14             1 2 72 73 74
Pooling                  maxpool2d_64             1 1 74 75 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_15             1 2 75 76 77
Pooling                  maxpool2d_65             1 1 77 78 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_4                    4 1 70 73 76 78 79 0=0
Convolution              convrelu_32              1 1 79 80 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072 9=1
Convolution              convrelu_33              1 1 80 81 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
Split                    splitncnn_16             1 2 81 82 83
Interp                   upsample_123             1 1 83 84 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_5                    2 1 84 55 85 0=0
Split                    splitncnn_17             1 2 85 86 87
Convolution              convrelu_37              1 1 87 88 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
Convolution              convrelu_34              1 1 86 89 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
Convolution              convrelu_35              1 1 89 90 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
Convolution              convrelu_36              1 1 90 91 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Concat                   cat_6                    2 1 91 88 92 0=0
Convolution              convrelu_38              1 1 92 93 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
Convolution              convrelu_39              1 1 93 94 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
Split                    splitncnn_18             1 2 94 95 96
Interp                   upsample_124             1 1 96 97 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_7                    2 1 97 31 98 0=0
Split                    splitncnn_19             1 2 98 99 100
Convolution              convrelu_43              1 1 100 101 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
Convolution              convrelu_40              1 1 99 102 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
Convolution              convrelu_41              1 1 102 103 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 9=1
Convolution              convrelu_42              1 1 103 104 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Concat                   cat_8                    2 1 104 101 105 0=0
Convolution              convrelu_44              1 1 105 106 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
Split                    splitncnn_20             1 2 106 107 108
Convolution              convrelu_45              1 1 108 109 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=36864 9=1
Concat                   cat_9                    2 1 109 95 110 0=0
Split                    splitncnn_21             1 2 110 111 112
Convolution              convrelu_49              1 1 112 113 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
Convolution              convrelu_46              1 1 111 114 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
Convolution              convrelu_47              1 1 114 115 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
Convolution              convrelu_48              1 1 115 116 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Concat                   cat_10                   2 1 116 113 117 0=0
Convolution              convrelu_50              1 1 117 118 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
Split                    splitncnn_22             1 2 118 119 120
Convolution              convrelu_51              1 1 120 121 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456 9=1
Concat                   cat_11                   2 1 121 82 122 0=0
Split                    splitncnn_23             1 2 122 123 124
Convolution              convrelu_55              1 1 124 125 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
Convolution              convrelu_52              1 1 123 126 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
Convolution              convrelu_53              1 1 126 127 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
Convolution              convrelu_54              1 1 127 128 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Concat                   cat_12                   2 1 128 125 129 0=0
Convolution              convrelu_56              1 1 129 130 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
Convolution              convsigmoid_57           1 1 107 131 0=18 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1152 9=4
Reshape                  view_128                 1 1 131 132 0=6400 1=6 2=3
Permute                  permute_134              1 1 132 133 0=1
Slice                    split_0                  1 3 133 134 135 136 -23300=3,2,2,2 1=2
MemoryData               pnnx_fold_grid.1         0 1 137 0=2 1=6400 2=1
BinaryOp                 mul_7                    1 1 134 138 0=2 1=1 2=2.000000e+00
BinaryOp                 sub_8                    1 1 138 139 0=1 1=1 2=5.000000e-01
BinaryOp                 add_9                    2 1 139 137 140 0=0
BinaryOp                 mul_10                   1 1 140 141 0=2 1=1 2=8.000000e+00
BinaryOp                 mul_11                   1 1 135 142 0=2 1=1 2=2.000000e+00
Split                    splitncnn_24             1 2 142 143 144
MemoryData               pnnx_fold_grid_.1        0 1 145 0=2 1=6400 2=3
BinaryOp                 mul_12                   2 1 143 144 146 0=2
BinaryOp                 mul_13                   2 1 146 145 147 0=2
BinaryOp                 mul_14                   1 1 136 148 0=2 1=1 2=1.000000e+02
Convolution              convsigmoid_58           1 1 119 149 0=18 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=4
Reshape                  view_129                 1 1 149 150 0=1600 1=6 2=3
Permute                  permute_135              1 1 150 151 0=1
Slice                    split_1                  1 3 151 152 153 154 -23300=3,2,2,2 1=2
MemoryData               pnnx_fold_grid0.1        0 1 155 0=2 1=1600 2=1
BinaryOp                 mul_15                   1 1 152 156 0=2 1=1 2=2.000000e+00
BinaryOp                 sub_16                   1 1 156 157 0=1 1=1 2=5.000000e-01
BinaryOp                 add_17                   2 1 157 155 158 0=0
BinaryOp                 mul_18                   1 1 158 159 0=2 1=1 2=1.600000e+01
BinaryOp                 mul_19                   1 1 153 160 0=2 1=1 2=2.000000e+00
Split                    splitncnn_25             1 2 160 161 162
MemoryData               pnnx_fold_grid_0.1       0 1 163 0=2 1=1600 2=3
BinaryOp                 mul_20                   2 1 161 162 164 0=2
BinaryOp                 mul_21                   2 1 164 163 165 0=2
BinaryOp                 mul_22                   1 1 154 166 0=2 1=1 2=1.000000e+02
Convolution              convsigmoid_59           1 1 130 167 0=18 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608 9=4
Reshape                  view_130                 1 1 167 168 0=400 1=6 2=3
Permute                  permute_136              1 1 168 169 0=1
Slice                    split_2                  1 3 169 170 171 172 -23300=3,2,2,2 1=2
MemoryData               pnnx_fold_grid1.1        0 1 173 0=2 1=400 2=1
BinaryOp                 mul_23                   1 1 170 174 0=2 1=1 2=2.000000e+00
BinaryOp                 sub_24                   1 1 174 175 0=1 1=1 2=5.000000e-01
BinaryOp                 add_25                   2 1 175 173 176 0=0
BinaryOp                 mul_26                   1 1 176 177 0=2 1=1 2=3.200000e+01
BinaryOp                 mul_27                   1 1 171 178 0=2 1=1 2=2.000000e+00
Split                    splitncnn_26             1 2 178 179 180
MemoryData               pnnx_fold_grid_1.1       0 1 181 0=2 1=400 2=3
BinaryOp                 mul_28                   2 1 179 180 182 0=2
BinaryOp                 mul_29                   2 1 182 181 183 0=2
BinaryOp                 mul_30                   1 1 172 184 0=2 1=1 2=1.000000e+02
Concat                   cat_13                   3 1 177 183 184 185 0=2
Concat                   cat_14                   3 1 159 165 166 186 0=2
Concat                   cat_15                   3 1 141 147 148 187 0=2
Reshape                  view_133                 1 1 187 188 0=6 1=19200
Reshape                  view_132                 1 1 186 189 0=6 1=4800
Reshape                  view_131                 1 1 185 190 0=6 1=1200
Concat                   cat_16                   3 1 188 189 190 out0 0=0
